tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'getantibody/tap'


# --- Terminal ----

# brew 'autojump'
# brew 'bat'
# brew 'dnsmasq'
# brew 'htop'
# brew 'httpie'
# brew 'imagemagick'
# brew 'mackup'
# brew 'nginx'
# brew 'pyenv'
# brew 'tree'
# brew 'wget'

brew 'speedtest-cli'
brew 'trash'
brew 'git'
brew 'mas'
brew 'antibody'


# --- Applications ---

# cask 'docker'
# cask 'memory'
# cask 'sketch'
# mas 'Spark', id: 1176895641
# mas 'Trello', id: 1278508951

# Browsers

cask 'firefox'
cask 'google-chrome'
cask 'opera'

# Others

cask '1password'
cask 'aerial'
cask 'bartender'
cask 'github'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'
mas 'Magnet', id: 441258766


# --- Fonts --- 

cask 'font-cascadia'
cask 'font-exo2'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-merriweather'
cask 'font-muli'
cask 'font-museo'
cask 'font-merriweather-sans'
cask 'font-noto-sans'
cask 'font-nunito'
cask 'font-open-sans'
cask 'font-oxygen'
cask 'font-pacifico'
cask 'font-playfair-display'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-rubik'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-spectral'
cask 'font-titillium'


# --- Java --- 

cask 'java'
brew 'maven'